Revit 2027 API
ParameterTypeId.FabricationPartDiameterOut Property
 "Main Secondary Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPartDiameterOut { get; }
Public Shared ReadOnly Property FabricationPartDiameterOut As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPartDiameterOut {
	ForgeTypeId^ get ();
}
static member FabricationPartDiameterOut : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace